Тестовая_база_ERP_14/src/Catalogs/CRM_СостоянияИнтересов/CRM_СостоянияИнтересов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияИнтересов</name>
  <comment>Сценарии продаж</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <comment>Состояние завершения интереса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УказаниеОжидаемойВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСостояния</name>
    <type>
      <types>EnumRef.CRM_ВидыСостоянияИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнениеКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеПланированиеАктивности</name>
    <type>
      <types>EnumRef.CRM_ПланируемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерактивноеПланированиеАктивностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьЗапланированныеАктивности</name>
    <type>
      <types>EnumRef.CRM_ЗавершаемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗавершаемыхАктивностей</name>
    <type>
      <types>EnumRef.CRM_ОтборыЗавершаемыхАктивностей</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДостигнутыйРезультат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВероятностьВпредставлениеСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/CRM_СостоянияИнтересов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоманднаяПанель.ТолькоПросмотр = Истина;
	
	Заголовок = НСтр("ru='Сценарий';en='Script'")+": "+Объект.Родитель.Наименование;
	
	Элементы.Используется.Видимость = НЕ ЗначениеЗаполнено(Объект.ВидСостояния);
	
	//Элементы.ВидСостояния.Видимость = (Объект.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение ИЛИ
	//Объект.ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзмененоСостояниеИнтереса", Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияНастройкиНажатие(Элемент)
	Настройки = Новый  Структура;
	Настройки.Вставить("УказаниеОжидаемойВыручки", Объект.УказаниеОжидаемойВыручки);
	Настройки.Вставить("ОбязательноеЗаполнениеКлиента", Объект.ОбязательноеЗаполнениеКлиента);
	Настройки.Вставить("ОбязательноеПланированиеАктивности", Объект.ОбязательноеПланированиеАктивности);
	Настройки.Вставить("ИнтерактивноеПланированиеАктивностей", Объект.ИнтерактивноеПланированиеАктивностей);
	Настройки.Вставить("ЗавершатьЗапланированныеАктивности", Объект.ЗавершатьЗапланированныеАктивности);
	Настройки.Вставить("ОтборЗавершаемыхАктивностей", Объект.ОтборЗавершаемыхАктивностей);
	Настройки.Вставить("УказыватьДостигнутыйРезультат", Объект.УказыватьДостигнутыйРезультат);
	Настройки.Вставить("ВидСостояния", Объект.ВидСостояния);
	Настройки.Вставить("ДобавитьВероятностьВпредставлениеСостояния", Объект.ДобавитьВероятностьВпредставлениеСостояния);
	Настройки.Вставить("ВероятностьСделки", Объект.ВероятностьСделки);
	Настройки.Вставить("ИндексЦвета", Объект.ИндексЦвета);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеРедактированияНастроек", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("Настройки", Настройки);
	ОткрытьФорму("Справочник.CRM_СостоянияИнтересов.Форма.ФормаНастройкиСостояния", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ИндексЦветаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповещениеНовое = Новый ОписаниеОповещения("ЦветНачалоВыбораЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ТекущийЦвет", Объект.ИндексЦвета);
	ФормаВыбораЦвета = ОткрытьФорму("Справочник.CRM_Категории.Форма.ФормаВыбораЦвета", ПараметрыФормы, Элемент,,,,
		ОповещениеНовое, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры // ЦветНачалоВыбора()

&НаКлиенте
// Продолжение процедуры "ЦветНачалоВыбора"
//
Процедура ЦветНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ (Результат = Неопределено) И НЕ (Результат = КодВозвратаДиалога.Отмена) Тогда
		Объект.ИндексЦвета = Результат[0].Картинка;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Справка(Команда)
	ПерейтиПоНавигационнойСсылке(CRM_ОбщегоНазначенияСервер.ПолучитьСсылкуНаРазделСправки("НастройкаСценариевПродажи"));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗавершениеРедактированияНастроек(Настройки, ДопПараметры) Экспорт
	
	Если Настройки<>Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, Настройки);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
